Revit 2027 API
ElectricalSystem.GroundConductorSize Property
 The size of a Ground Conductor in the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GroundConductorSize { get; }
Public ReadOnly Property GroundConductorSize As ElementId
	Get
public:
property ElementId^ GroundConductorSize {
	ElementId^ get ();
}
member GroundConductorSize : ElementId with get
Property Value
ElementId
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 Each Ground Conductor has the same size in the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace